app/views/messages/index.html.erb

SELECT "messages".* FROM "messages"
SELECT COUNT(*) FROM "messages"
---
  <span id="message_counter">
    <%= Message.count %>