app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_message
      @message = Message.find(params[:id])