app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC
---
  def index
    @messages = Message.order(created_at: :desc)

INSERT INTO "messages" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "good1"], ["created_at", "2024-04-28 12:30:47.027489"], ["updated_at", "2024-04-28 12:30:47.027489"]]
SELECT COUNT(*) FROM "messages"
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
        format.turbo_stream do
          render turbo_stream: [
            turbo_stream.update('new_message',
                                partial: 'messages/form',
                                locals: { message: Message.new }),
            turbo_stream.prepend('messages',
                                partial: 'messages/message',
                                locals: { message: @message }),
            turbo_stream.update('message_counter', html: "#{Message.count}")
          ]

UPDATE "messages" SET "body" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["body", "hello, cool gir.d"], ["updated_at", "2024-04-28 12:49:58.342917"], ["id", 20]]
UPDATE "messages" SET "body" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["body", "sdddddd"], ["updated_at", "2024-04-28 12:53:21.847054"], ["id", 22]]
---
  def update
    respond_to do |format|
      if @message.update(message_params)
        format.turbo_stream do
          render turbo_stream: turbo_stream.update(@message, partial: "messages/message", locals: { message: @message })

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 19]]
SELECT COUNT(*) FROM "messages"
---
  def destroy
    @message.destroy!

    respond_to do |format|
      format.turbo_stream do
        render turbo_stream: [
          turbo_stream.remove(@message),
          turbo_stream.update('message_counter', html: "#{Message.count}")
        ]

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def set_message
      @message = Message.find(params[:id])